import os
import torch



input("ты кому хочешь оценки ставить?")
print("моя программа - обычный мини-электронный дневник на день")
print("███╗   ███╗██╗███╗   ██╗██╗ ")
print("███╗   ███╗██╗███╗   ██╗██╗ ")
print("██╔████╔██║██║██╔██╗ ██║██║      ")
print("█║╚██╔╝██║██║██║╚██╗██║██║  ")
print("██║ ╚═╝ ██║██║██║ ╚████║██║      ")
print("██████╗ ███╗   ██╗███████╗██╗   ██╗")
print("██╔══██╗████╗  ██║██╔════╝██║   ██║")
print("██║  ██║██╔██╗ ██║█████╗  ██║   ██║")
print("██████╔╝██║ ╚████║███████╗ ╚████╔╝ ")
print("╚═════╝ ╚═╝  ╚═══╝╚══════╝  ╚═══╝  ")
print("[1] - проверить мин оценки")
print("[2] - проверить макс оценку")
print("[5] - все оценики")
print("[4] - поставить оценку")
while True:
    x = int(input("..."))
    if x == 1:
        print(torch.min(you))
    elif x == 2:
        print(torch.max(you))
    elif x == 4:
        a = int(input("первая оценка:"))
        a1 = int(input("вторая оценка:"))
        a2 = int(input("третия оценка:"))
        a3 = int(input("четвертая оценка:"))
        a4 = int(input("пятая оценка:"))
        a5 = int(input("шестая оценка"))
    elif 5 == x:
        print(torch.mean(you))
    else:
        print("бем бем бем")
    your_ochenki = [a, a1, a2, a3, a4, a5]
    you = torch.tensor([[your_ochenki]
    ])
    

